Tekla Open API Reference for Tekla Structures 2025
PropertyElement.PropertyElementType.SurfacingMarkPropertyElementTypes Class
 The SurfacingMarkPropertyElementTypes class represents the available property element types for surfacing marks.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PropertyElement.PropertyElementType.SurfacingMarkPropertyElementTypes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public static class SurfacingMarkPropertyElementTypes
<SerializableAttribute>
Public NotInheritable Class SurfacingMarkPropertyElementTypes
The PropertyElement.PropertyElementType.SurfacingMarkPropertyElementTypes type exposes the following members.
Methods
Name | Description
Class
Returns the class property element type.
Code
Returns the code property element type.
Material
Returns the material property element type.
Name
Returns the name property element type.
SurfaceTreatmentName
Returns the surface treatment name property element type.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace